demo-output/website/dafoam/rans_model_comparison/kEpsilon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(wallTop|wallSide)"
    {
        type            zeroGradient;
    }

    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }

    "(symmetryBottom|symmetrySide)"
    {
        type            symmetry;
    }

}

// ************************************************************************* //
