demo-output/website/dafoam/rans_model_comparison/kEpsilon/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3025
(
(0.0005 4.569624892e-05 4.569624892e-05)
(0.0005 0.0001329345423 4.569624891e-05)
(0.0005 0.0002122420817 4.569624891e-05)
(0.0005 0.0002843398448 4.569624891e-05)
(0.0005 0.0003498832659 4.569624891e-05)
(0.0005 0.0004094681941 4.569624891e-05)
(0.0005 0.0004636363106 4.569624891e-05)
(0.0005 0.000512880053 4.569624891e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
55
(
(0.0005 0.001 4.569624891e-05)
(0.0005 0.001 0.0001329345423)
(0.0005 0.001 0.0002122420817)
(0.0005 0.001 0.0002843398449)
(0.0005 0.001 0.0003498832659)
(0.0005 0.001 0.0004094681941)
(0.0005 0.001 0.0004636363106)
(0.0005 0.001 0.000512880053)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
55
(
(0.0005 4.569624891e-05 0.001)
(0.0005 0.0001329345423 0.001)
(0.0005 0.0002122420817 0.001)
(0.0005 0.0002843398448 0.001)
(0.0005 0.0003498832659 0.001)
(0.0005 0.0004094681941 0.001)
(0.0005 0.0004636363106 0.001)
(0.0005 0.000512880053 0.001)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
